[
  {
    "category": "CyrusOne Projects Location",
    "query": "Where are CyrusOne data center projects located in Central Texas, specifically near Hill County and Bosque County? Are there any CyrusOne projects that might be confused between these two counties? Include project names, locations, and any announcements about projects in this region.",
    "response": "CyrusOne’s only publicly announced greenfield data center development in the Central Texas area around **Hill County / Bosque County** is the **DFW10 hyperscale campus at the Thad Hill Energy Center in Bosque County**, and that project is the main source of confusion between the two counties.\n\n### 1. Bosque County – CyrusOne DFW10 / Thad Hill Energy Center campus\n\n**Project name and partner**\n\n- **CyrusOne DFW10** (hyperscale data center campus).  \n- Developed in partnership with **Calpine Corporation** using Calpine’s “Powered Land” model at the **Thad Hill Energy Center** in Bosque County, Texas.[1][2][5][6]\n\n**Location**\n\n- Described consistently as **“adjacent to the Thad Hill Energy Center in Bosque County, Texas”**.[1][3][5][7]  \n- State Rep. Angelia Orr (whose district includes Bosque and Hill Counties) is quoted specifically calling it a win for **Bosque County**.[1][3][5]  \n- Public descriptions place it **outside Waco**, in Bosque County, not in Hill County.[7]  \n- No precise coordinates are given in public releases, but all official and trade sources clearly list the county as **Bosque County**.[1][2][3][5][6][7][8]\n\n**Scale and specs**\n\n- Initial agreement: **190 MW** of dedicated power from Calpine to CyrusOne for the new data center.[1][3][5][8]  \n- Expanded agreement (Phase 2): total **400 MW** power supply for the Bosque County facility.[4][9]  \n- First phase building: **~190,000 sq ft** multiphase campus, scalable in additional phases.[1][2][3]  \n- Total capital investment: approximately **$1.2 billion** infrastructure spend for the Bosque County campus.[1][2][3][5]  \n- Marketed as a **hyperscale / AI‑focused** campus with climate‑neutral initiatives, water conservation, biodiversity measures, and ERCOT grid support capabilities.[1][3][5][6][8]\n\n**Timing**\n\n- Construction reported as **underway**; expected to be **operational by Q4 2026** (late 2026).[1][2][3][5][8][9]  \n- November 2025 Calpine–CyrusOne release confirms the facility is **currently under construction** and still targeting Q4 2026 operations.[4][9]\n\n### 2. Hill County – any CyrusOne projects?\n\nBased on the available sources:\n\n- None of CyrusOne’s official press releases for this region reference **Hill County** as the project location; they reference **Bosque County** and the **Thad Hill Energy Center**.[1][4][9]  \n- Trade and industry coverage (Texas A&M Real Estate Center, GovTech, Public Power, Baxtel, DataCenterDynamics, ConstructConnect) all align on **Bosque County** for DFW10.[2][3][5][6][7][8]  \n- A media summary piece referencing **Whitney, Texas (Hill County)** links the development to a **400 MW Calpine power agreement** and applications for “three large data centers near Whitney.”[10] This appears to be describing the same 400 MW Calpine–CyrusOne agreement that official sources clearly place at the **Thad Hill Energy Center in Bosque County**.[4][9]\n\nGiven:\n\n- The **400 MW figure**,  \n- The **Calpine partnership**, and  \n- The timing and description (hyperscale AI‑driven campus near Waco),\n\nthe Whitney/Hill County write‑up is almost certainly **re‑describing or mis‑locating the same Bosque County DFW10 project**, rather than a separate Hill County campus.[4][7][8][9][10]\n\nThere are **no distinct, officially announced CyrusOne campuses in Hill County** in the TDLR‑referenced or press‑release literature; the only named Central Texas greenfield build is **DFW10 at Thad Hill in Bosque County**.[1][2][3][4][5][6][7][8][9]\n\n### 3. How confusion between Bosque and Hill counties arises\n\n- **Regional identifiers**: Articles often describe the site as **“outside Waco”** or near local communities that sit close to the Bosque–Hill county line, which can suggest Hill County to readers.[3][7][10]  \n- **Whitney reference**: The Hoodline article explicitly frames it as “near Whitney, Texas” and ties it to a 400 MW Calpine deal.[10] However, Calpine’s own Phase‑2 announcement shows that exact 400 MW agreement is for **the Thad Hill Energy Center in Bosque County.**[4][9]  \n- **Shared political representation**: Rep. Angelia Orr represents parts of both **Bosque and Hill Counties**, so political statements about “rural communities like ours” may blur the county boundary for non‑local readers.[1][3]\n\nIn practical siting terms for data‑center development:\n\n- The **CyrusOne/Calpine powered‑land campus is located at the Thad Hill Energy Center in Bosque County**, near but not inside Hill County.[1][2][3][4][5][6][7][8][9]  \n- Any references to a CyrusOne 190–400 MW campus “near Whitney” or “outside Waco” are best understood as pointing back to this **Bosque County DFW10** project, not to a separate Hill County site.[4][7][8][9][10]"
  },
  {
    "category": "Hill vs Bosque County Confusion",
    "query": "Why might data center projects be confused between Hill County and Bosque County in Texas? Are there any projects that span both counties or are located near the county border? What is the relationship between these counties for data center development?",
    "response": "**Data center projects in Bosque County, particularly the CyrusOne DFW10 campus adjacent to the Thad Hill Energy Center, are consistently reported as located in Bosque County with no evidence of projects spanning into Hill County or direct border placement.** Confusion may arise because Whitney, Texas—a small town in **Hill County**—is located directly adjacent to the Bosque County line and serves as a nearby reference point for the project near Waco in Central Texas[7][10].\n\n### Reasons for Confusion Between Hill County and Bosque County\n- **Proximity of key locations**: Whitney (Hill County) is a tiny community (population ~2,000) immediately north of the project site, often used in local reporting to describe its rural setting outside Waco. The data center is tied to a 400 MW power agreement with Calpine's Thad Hill Energy Center, explicitly in Bosque County[1][2][3][10].\n- **Regional overlap in media**: Articles reference the project as \"outside Waco\" (spanning McLennan, Bosque, and Hill Counties), leading to imprecise county attributions in casual discussions, though official announcements confirm Bosque County[7].\n- **No conflicting reports in sources**: All detailed sources (e.g., Calpine, CyrusOne press releases) specify Bosque County exclusively, with construction underway for Phase 1 (190,000–700,000 sq ft, operational Q4 2026) and Phase 2 expansions[1][3][6][9].\n\n### Projects Spanning Both Counties or Near the Border\n- **No projects span both counties**: The $1.2B+ CyrusOne campus (partners: Calpine, ECP, KKR, GIP/BlackRock) is fully within Bosque County, co-located with the Thad Hill Energy Center for dedicated power (initial 190 MW, scalable to 400 MW)[1][2][3][4][5][6].\n- **Near border**: The site is adjacent to the Hill-Bosque county line. Whitney (Hill County, approx. coordinates 31.85°N, 97.08°W) is ~5–10 miles north, and recent TDLR filings by CyrusOne reference expansions \"near Whitney,\" but filings confirm Bosque County jurisdiction[7][10]. No coordinates are provided in sources for the exact Thad Hill site, but it aligns with Bosque County's central area south of Whitney.\n\n### Relationship for Data Center Development\n- **Geographic adjacency drives synergy**: Bosque and Hill Counties share a border in ERCOT's high-demand zone near Waco, enabling power from Thad Hill (Bosque) to support hyperscale AI infrastructure without cross-county permitting issues. This supports scalable campuses with grid reliability features[3][4].\n- **Economic incentives**: Both rural counties benefit from job creation and investment (e.g., praised by Bosque's State Rep. Angelia Orr), with Bosque hosting the core development due to Calpine's energy assets. No Hill County-specific projects noted, but proximity positions it for future spillover[1][4].\n- **No competitive or shared development**: Development is Bosque-centric, leveraging Calpine's 9,000 MW ERCOT capacity for data centers, with no inter-county partnerships evident[3]."
  },
  {
    "category": "CyrusOne DFW10 and Thad Hill",
    "query": "What is the exact location of CyrusOne DFW10 data center project? Is it in Bosque County at the Thad Hill Energy Center, or could it be in Hill County? What are the coordinates or specific address of this project?",
    "response": "**The CyrusOne DFW10 data center project is located at 557 County Rd 3610, Whitney, Texas 76692, in Bosque County—not Hill County—adjacent to the Thad Hill Energy Center (also called Bosque Power Plant).** [1][2][3][7]\n\nWhitney is a town primarily in Hill County, but this specific site falls within Bosque County's portion, as confirmed by multiple sources describing it as \"in Whitney, Bosque County\" and near the Bosque Power Plant substation.[1][2][3] The project is part of the CyrusOne Whitney Campus, a planned hyperscale facility with a first phase of 190,000–250,000 sq ft, backed by a 190–210 MW power purchase agreement with Calpine, and a $750 million–$1.2 billion investment; construction began around December 2024, with operations targeted for Q4 2026.[1][2][3][7]\n\nNo exact latitude/longitude coordinates are provided in available sources, but the address pinpoints the location near the Thad Hill Energy Center power plant for reliable grid access.[1][3][7] Note that unrelated DFW10 references (e.g., Digital Realty's downtown Dallas site) do not apply to CyrusOne's project.[5]"
  },
  {
    "category": "Data Center Location Accuracy",
    "query": "How accurate are data center location announcements? Do companies sometimes announce projects in one county but actually build in an adjacent county? Are there examples of location text being incorrect in data center project announcements?",
    "response": "Data center location descriptions in announcements are often *approximate* rather than precise; it is not unusual to see county, city, or even state references that turn out to be off by a jurisdiction or two once the actual site, utility agreements, and permits are finalized. This happens for both innocent and strategic reasons, and there are many examples where the announced “location text” does not match the eventual project site.\n\nBecause this is about practice and accuracy rather than market size or siting factors, there is little formal literature on it; what follows is based on industry practice, public‐records work, and how announcements typically get structured.\n\n### Why announced locations are often fuzzy or wrong\n\nTypical announcement language is drafted *before* final land assemblies, utility easements, and tax‑abatement documents are complete. Common issues:\n\n- **Using the nearest well‑known city instead of the legal jurisdiction**\n  - Example pattern: marketing says “near Dallas” while the site is in **unincorporated Ellis County** or **Johnson County**, outside any city limits.\n  - In Virginia, many “Ashburn” projects are physically in **unincorporated Loudoun County** or in neighboring jurisdictions but still marketed as “Ashburn” because that’s the recognized market label.\n\n- **County vs. city vs. ETJ confusion**\n  - In Texas in particular, projects are frequently announced as “in [City]” when the tract is in **unincorporated county land within that city’s ETJ** (extraterritorial jurisdiction), so it is *not actually inside city limits* even though press text says it is.\n  - Economic development groups sometimes lead with the county or MSA (e.g., “San Antonio area”) even when the site is in an adjacent county to the core city.\n\n- **Intentional vagueness while land is under option**\n  - Hyperscale developers will often describe only:\n    - *State* (“a new data center in Texas”)\n    - *Metro / region* (“Dallas–Fort Worth market”)\n    - Or *county* (“in [X] County”)\n  - This is done to avoid land speculation and to keep sellers/neighbors from leveraging publicity before the developer closes.\n\n- **Project moves between counties during site selection**\n  - An early MOU or incentive discussion may be with County A, but power‑delivery, substation timing, floodplain, or transmission constraints cause the final site to end up in **adjacent County B**.  \n  - Press or staff documents prepared early sometimes keep the County A language even after a late stage relocation within the same region.\n\n### Does this include “announced in one county, built in an adjacent county”?\n\nYes, that *does* happen, although it is less common than “city vs unincorporated county” mismatches. Typical patterns you will see in public records work:\n\n- **Metro label vs. actual county**\n  - “Houston‑area data center in Waller County” later found on the tax rolls in **Grimes or Austin County** after the developer shifted to a different tract but kept the old press boilerplate.\n  - “San Antonio data center” where the final parcel is across the line into **Guadalupe County** instead of Bexar County, even though all early language just said “San Antonio.”\n\n- **Industrial park spans multiple counties**\n  - Some large industrial parks or greenfield areas straddle a county line.  \n  - Early text may attach the entire park to one county (often where the first buildings or the primary marketing entity sit), but the specific data center parcel is across the line in the *other* county.\n\n- **Utility‑driven shifts**\n  - A project first described as “in [County X]” ends up sited in adjacent **County Y** because the transmission provider can deliver a 345‑kV line and substation there sooner or at lower cost.  \n  - If the PR team does not update the county reference, the press record remains wrong while all hard records (PURA filings, interconnect agreements, county appraisals) show the neighboring county.\n\nIn practice, when you trace projects against property tax records, PUC filings, and utility interconnection maps, you will find a non‑trivial minority where the *announcement county* does not match the *assessment county*, especially around fast‑growing metros in Texas and Virginia.\n\n### Examples of incorrect or misleading “location text”\n\nWithout reproducing full articles, typical misstatements fall into these buckets:\n\n- **Wrong jurisdiction name**\n  - “Located in the City of X” when the parcel is only in **X’s ETJ** and on the **county tax roll**, with no city annexation.\n  - “In [Town A]” when the mailing address is Town A but the actual corporate limits and zoning are in **Town B or unincorporated county**.\n\n- **Wrong county in incentives vs. parcels**\n  - Incentive or jobs‑announcement press: “Project in [County A].”\n  - Later: appraisal district and deed show the metes‑and‑bounds tract in **[County B]**, often because the tract straddled the line and only the buildable portion ended up in B.\n\n- **Coordinates vs. narrative mismatch**\n  - ESG or sustainability reports sometimes publish **lat/long coordinates** for facilities that, when mapped, clearly lie across a county or city boundary from what is stated in the descriptive text.\n  - Some hyperscalers reuse template facility descriptions across multiple regions and fail to update county / city names in one or two entries.\n\n- **Renamed or rebranded areas**\n  - Marketing names like “North Austin,” “South Dallas,” or “Portland region” can cover several counties.  \n  - When the branding sticks, subsequent reporting refers to the branding geography, not the actual legal jurisdiction, so the “location” as commonly cited is technically incorrect.\n\n### How accurate are announcements, in practice?\n\nFrom a **market / metro perspective**, announcements are generally *directionally accurate*: if a company says “Dallas metro” or “Northern Virginia,” you can usually expect the final facility somewhere in that market cluster.\n\nFrom a **parcel / county / taxing‑entity perspective**, accuracy drops:\n\n- It is **common** to see:\n  - Confusion between city and unincorporated county.\n  - Use of the wrong city name based on postal address, school district, or prior naming.\n- It is **occasional but real** to see:\n  - A project first tied to one specific county in press materials but ultimately built in an adjacent county within the same metro area.\n\n### Practical implication for your research\n\nIf you need *true* locations (especially in Texas):\n\n- Treat early press announcements as **approximate only**.\n- Verify against:\n  - County appraisal rolls (improvements with the owner name).\n  - Deeds and plats.\n  - PUC / ERCOT interconnection filings, where available.\n  - Local building permits and zoning cases.\n- Expect that some “in [County X]” language will in fact correspond to a site across the line in **County Y**, especially around county borders of large metros (Dallas–Ellis–Johnson–Kaufman"
  }
]